app/controllers/api/photos_controller.rb

  def create
    owner_id = current_user.id
    total_photo_params = photo_params.merge({ owner_id: owner_id })
    @photo = Photo.create!(total_photo_params)
---
INSERT INTO "photos" ("cloudinary_id", "created_at", "owner_id", "updated_at", "url") VALUES ($1, $2, $3, $4, $5) RETURNING "id"