app/controllers/api/profiles_controller.rb

SELECT  "profiles".* FROM "profiles"  WHERE "profiles"."owner_id" = 1  ORDER BY "profiles"."id" ASC LIMIT 1
---
  def show
    user_id = params[:id]
    @profile = Profile.where(owner_id: user_id).first