app/controllers/sessions_controller.rb

  def destroy
    @user = current_user
    userid = @user.id
    Login.where(user_id: userid, session_token: session[:session_token]).destroy_all
---
DELETE FROM "logins" WHERE "logins"."id" = $1  [["id", 1]]
SELECT "logins".* FROM "logins"  WHERE "logins"."user_id" = 1 AND "logins"."session_token" = '86N5BCMQctisIh0GpNCxGQ'